#+TITLE: LabBook
#+AUTHOR: Lucas M. Schnorr
#+STARTUP: overview indent
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

C-c C-v t


* 2025-10-21
** Leitura e viz básica
#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
suppressMessages(library(starvz))
#starvz_read("./src/experiment-5/lws_5120_256_0_10_10/", selective=FALSE) -> svz
#starvz_read("../../otho/wamca-2025/output_nmad_traces_721225/nmad_traces_360_dmdas_1/") -> svz
#starvz_read("./meeting/traces/cei_724279/output_cei_724279/teste_lws_1x1_1/", selective=FALSE) -> svz
#starvz_read("./meeting/cholesky/728705/output_teste_728705/cholesky_360_1", selective=FALSE) -> svz
#starvz_read("./meeting/cholesky_360_36000_1x6", selective=FALSE) -> svz
starvz_read("./729242/output_teste_729242/cholesky_360_36000_2x1", selective=FALSE) -> svz
#svz$config$st$idleness <- TRUE
svz$config$st$outliers <- FALSE
svz$config$st$labels <- "NODES_only"
svz$config$st$aggregation$active <- FALSE
svz$config$st$aggregation$step <- 1000
svz$config$st$aggregation$method <- "nodes"
svz$config$ready$step <- 1
# taskdep
#svz$config$st$tasks$active <- TRUE
#svz$config$st$tasks$list <- c("637")
#svz$config$st$tasks$levels <- 2
# abe
svz$config$st$abe$active <- TRUE
# step to panel_ready
svz$config$ready$step <- 100
(panel_st(svz) + theme(axis.title.x=element_blank(),
                       axis.text.x=element_blank())) /
  panel_ready(svz)
#+end_src

#+RESULTS:

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
panel_st(svz)
#+end_src

#+RESULTS:

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
svz$Application |>
  filter(grepl("^0_", ResourceId)) |>
  select(ResourceId, Start, End, Value, JobId) |>
  filter(Start >= 0) |>
  group_by(ResourceId) |>
  arrange(Start) |>
  mutate(End.Anterior = lag(End)) |>
  arrange(ResourceId) |>
  mutate(Delay = Start - End.Anterior) |>
  filter(Start > 10000) |>
  arrange(-Delay) |>
  slice(1) |>
  print(n=100) |>
  pull(JobId) -> svz$config$st$tasks$list

svz$config$limits$start <- 24000
svz$config$limits$end <- 24500
#svz$config$limits <- NULL
svz$config$limits$start <- 15000
svz$config$limits$end <- 16500
svz$config$limits <- NULL
# taskdep
svz$config$st$tasks$active <- FALSE
svz$config$st$tasks$levels <- 1
# step to panel_ready
svz$config$ready$step <- 1000
# abe
svz$config$st$abe$active <- TRUE
panel_st(svz) /
  panel_ready(svz) #/
#  panel_lackready(svz)
#  panel_mpistate(svz) /
#  panel_mpiconcurrent(svz)  
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 22 × 7
# Groups:   ResourceId [22]
   ResourceId   Start     End Value JobId   End.Anterior Delay
   <chr>        <dbl>   <dbl> <fct> <chr>          <dbl> <dbl>
 1 0_CPU0     114968. 114980. dgemm 0_36140      108162. 6806.
 2 0_CPU1     114968. 114980. dgemm 0_36141      108210. 6758.
 3 0_CPU10    115228. 115346. dgemm 0_37564      109345. 5882.
 4 0_CPU11    115228. 115367. dgemm 0_37565      109406. 5822.
 5 0_CPU12    115228. 115237. dgemm 0_37566      109345. 5882.
 6 0_CPU13    115228. 115262. dgemm 0_37567      109347. 5880.
 7 0_CPU14    114968. 115046. dgemm 0_36132      107960. 7008.
 8 0_CPU15    114968. 115046. dgemm 0_36133      107960. 7008.
 9 0_CPU16    114968. 114974. dgemm 0_36134      108210. 6758.
10 0_CPU17    114968. 114975. dgemm 0_36135      108130. 6838.
11 0_CPU18    114968. 114976. dgemm 0_36136      108150. 6818.
12 0_CPU19    114968. 114976. dgemm 0_36137      108085. 6883.
13 0_CPU2     115133. 115194. dgemm 0_33021      108234. 6899.
14 0_CPU20    114968. 114976. dgemm 0_36138      108085. 6883.
15 0_CPU21    114968. 114980. dgemm 0_36139      108130. 6838.
16 0_CPU3     115133. 115210. dgemm 0_33022      108214. 6919.
17 0_CPU4     115133. 115162. dgemm 0_33023      108226. 6907.
18 0_CPU5     115133. 115136. dgemm 0_33024      109390. 5743.
19 0_CPU6     115133. 115136. dgemm 0_33025      109390. 5743.
20 0_CPU7     115133. 115138. dgemm 0_33026      109344. 5789.
21 0_CPU8     115133. 115138. dgemm 0_33027      109390. 5743.
22 0_CPU9     115133. 115139. dgemm 0_33028      109344. 5789.
#+end_example


#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
svz$Comm_state |>
#  filter(Start > 24200) |>
  count(Value)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 10 × 2
   Value                n
   <fct>            <int>
 1 Callback            37
 2 Polling           3211
 3 Processing        5748
 4 ReceiveCompleted   820
 5 ReceiveSubmitted   820
 6 Sc                6798
 7 SendCompleted      820
 8 SendSubmitted      820
 9 Sleeping          1488
10 Submitting task   1721
#+end_example

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
svz$Link# |>
#  count(Type)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 11,780 × 13
   Container Type    Start   End Duration  Size Origin Dest  Key   Tag   MPIType
   <fct>     <fct>   <dbl> <dbl>    <dbl> <int> <fct>  <fct> <fct> <fct> <fct>  
 1 0_program Work s… -169. -169.        0     0 0_CPU8 0_CP… stea… <NA>  <NA>   
 2 0_program Work s… -169. -169.        0     0 0_CPU9 0_CP… stea… <NA>  <NA>   
 3 0_program Work s… -168. -168.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 4 0_program Work s… -168. -168.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 5 0_program Work s… -168. -168.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 6 0_program Work s… -167. -167.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 7 0_program Work s… -167. -167.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 8 0_program Work s… -167. -167.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
 9 0_program Work s… -167. -167.        0     0 0_CPU… 0_CP… stea… <NA>  <NA>   
10 0_program Work s… -167. -167.        0     0 0_CPU2 0_CP… stea… <NA>  <NA>   
# ℹ 11,770 more rows
# ℹ 2 more variables: Priority <int>, Handle <fct>
# ℹ Use `print(n = ...)` to see more rows
#+end_example

* 2025-10-23
#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
options(crayon.enabled=FALSE)
suppressMessages(library(tidyverse))
suppressMessages(library(starvz))
#starvz_read("./src/experiment-5/lws_5120_256_0_10_10/", selective=FALSE) -> svz
#starvz_read("../../otho/wamca-2025/output_nmad_traces_721225/nmad_traces_360_dmdas_1/") -> svz
#starvz_read("./meeting/traces/cei_724279/output_cei_724279/teste_lws_1x1_1/", selective=FALSE) -> svz
#starvz_read("./meeting/cholesky/728705/output_teste_728705/cholesky_360_1", selective=FALSE) -> svz
#starvz_read("./meeting/cholesky_360_36000_1x6", selective=FALSE) -> svz
#starvz_read("./traces/729242/output_teste_729242/cholesky_360_36000_2x1", selective=FALSE) -> svz
#starvz_read("./traces/729258/output_teste_729258/cholesky_360_36000_2x1", selective=FALSE) -> svz
starvz_read("./traces/729259/output_teste_729259/cholesky_360_36000_2x1", selective=FALSE) -> svz
#svz$config$st$idleness <- TRUE
svz$config$st$outliers <- FALSE
svz$config$st$labels <- "NODES_only"
svz$config$st$aggregation$active <- FALSE
svz$config$st$aggregation$step <- 1000
svz$config$st$aggregation$method <- "nodes"
svz$config$ready$step <- 1
# taskdep
#svz$config$st$tasks$active <- TRUE
#svz$config$st$tasks$list <- c("637")
#svz$config$st$tasks$levels <- 2
# abe
svz$config$st$abe$active <- TRUE
# step to panel_ready
svz$config$ready$step <- 100
(panel_st(svz) + theme(axis.title.x=element_blank(),
                       axis.text.x=element_blank())) /
(panel_st_runtime(svz) + theme(axis.title.x=element_blank(),
                       axis.text.x=element_blank())) /
  panel_ready(svz)
#+end_src

#+RESULTS:

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
str(svz)
#+end_src

#+RESULTS:
#+begin_example
List of 21
 $ Origin      : chr "./meeting/traces/cei_724279/output_cei_724279/teste_lws_1x1_1/"
 $ Application : tibble [13,014 × 24] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : chr [1:13014] "0_CPU0" "0_CPU0" "0_CPU0" "0_CPU0" ...
  ..$ Start       : num [1:13014] -172 -168 -164 -160 -156 ...
  ..$ End         : num [1:13014] -168 -166 -162 -158 -154 ...
  ..$ Duration    : num [1:13014] 3.82 1.6 1.96 2.63 2.03 ...
  ..$ Depth       : num [1:13014] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Value       : Factor w/ 19 levels "0.000000","1.000000",..: 9 9 9 9 9 9 9 9 9 9 ...
  ..$ Size        : int [1:13014] 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 ...
  ..$ Params      : Factor w/ 6 levels "1036800","2073600",..: 4 4 4 4 4 4 4 4 4 4 ...
  ..$ Footprint   : Factor w/ 6 levels "07288a93","0b82a557",..: 2 2 2 2 2 2 2 2 2 2 ...
  ..$ Tag         : Factor w/ 4 levels "0000000000000000",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ JobId       : chr [1:13014] "0_22" "0_44" "0_66" "0_88" ...
  ..$ SubmitOrder : chr [1:13014] "0_22" "0_44" "0_66" "0_88" ...
  ..$ GFlop       : num [1:13014] 5 12 21 30 41 21 34 20 37 29 ...
  ..$ X           : int [1:13014] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Y           : int [1:13014] 1 2 3 4 5 7 8 10 11 13 ...
  ..$ Iteration   : int [1:13014] 4 10 18 26 36 14 26 10 26 16 ...
  ..$ Subiteration: int [1:13014] -1 -1 -1 -1 -1 -1 -1 -1 -1 -1 ...
  ..$ NumaNodes   : chr [1:13014] "-1, -1" "-1, -1" "-1, -1" "-1, -1" ...
  ..$ Node        : Factor w/ 2 levels "0","1": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Resource    : Factor w/ 23 levels "CPU0","CPU1",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ ResourceType: Factor w/ 2 levels "CPU","tate": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Outlier     : logi [1:13014] FALSE FALSE FALSE FALSE FALSE FALSE ...
  ..$ Height      : num [1:13014] 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Position    : num [1:13014] 44 44 44 44 44 44 44 44 44 44 ...
 $ Colors      : tibble [4 × 3] (S3: tbl_df/tbl/data.frame)
  ..$ Value: Factor w/ 19 levels "0.000000","1.000000",..: 8 10 7 9
  ..$ Color: chr [1:4] "#e41a1c" "#377eb8" "#4daf4a" "yellow"
  ..$ Use  : logi [1:4] TRUE TRUE TRUE FALSE
 $ Comm_state  : tibble [22,283 × 9] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : Factor w/ 2 levels "0_mpict","1_mpict": 1 1 1 1 1 1 1 1 2 2 ...
  ..$ Start       : num [1:22283] -175.77 -174.73 -174.73 -174.72 -1.09 ...
  ..$ End         : num [1:22283] -174.73 -174.73 -174.72 -1.09 -1.09 ...
  ..$ Duration    : num [1:22283] 1.04 4.10e-03 1.38e-03 1.74e+02 1.84e-03 ...
  ..$ Depth       : num [1:22283] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Value       : Factor w/ 10 levels "Callback","Polling",..: 9 2 9 9 2 3 2 9 9 2 ...
  ..$ Node        : Factor w/ 2 levels "0","1": 1 1 1 1 1 1 1 1 2 2 ...
  ..$ Resource    : Factor w/ 1 level "mpict": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ ResourceType: Factor w/ 1 level "mpict": 1 1 1 1 1 1 1 1 1 1 ...
 $ Dag         : tibble [163,162 × 6] (S3: tbl_df/tbl/data.frame)
  ..$ JobId    : chr [1:163162] "0_402" "0_3102" "0_5206" "0_645" ...
  ..$ Dependent: Factor w/ 42319 levels "0_1","0_10","0_100",..: 1 2 2 2 3 3 3 4 5 6 ...
  ..$ Start    : num [1:163162] NA NA 282 NA NA ...
  ..$ End      : num [1:163162] NA NA 470 NA NA ...
  ..$ Cost     : num [1:163162] 0 0 -188 0 0 ...
  ..$ Value    : Factor w/ 19 levels "0.000000","1.000000",..: NA NA 10 NA NA 7 NA NA NA 7 ...
 $ Data_handles: tibble [1,947 × 8] (S3: tbl_df/tbl/data.frame)
  ..$ Handle     : Factor w/ 1850 levels "27e92650","27e9cf40",..: 1 2 3 4 5 6 7 8 9 10 ...
  ..$ HomeNode   : num [1:1947] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ MPIRank    : num [1:1947] 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Size       : num [1:1947] 1036800 1036800 1036800 1036800 1036800 ...
  ..$ Description: Factor w/ 2 levels "M360x360x7","v1036800": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Coordinates: chr [1:1947] "0 1" "0 3" "0 5" "0 7" ...
  ..$ MPIOwner   : num [1:1947] 1 1 1 1 1 1 1 1 1 1 ...
  ..$ MPITag     : num [1:1947] 40 120 200 280 360 440 520 600 680 760 ...
 $ Entities    : spc_tbl_ [763 × 4] (S3: spec_tbl_df/tbl_df/tbl/data.frame)
  ..$ Parent: chr [1:763] "0" "0" "root" "root" ...
  ..$ Name  : chr [1:763] "0" "root" "MPI communication" "1_program" ...
  ..$ Type  : chr [1:763] "0" "MPI Program" "MPI communication" "Program" ...
  ..$ Nature: chr [1:763] "Container" "Container" "Link" "Container" ...
  ..- attr(*, "spec")=
  .. .. cols(
  .. ..   Parent = col_character(),
  .. ..   Name = col_character(),
  .. ..   Type = col_character(),
  .. ..   Nature = col_character()
  .. .. )
 $ Events_data : tibble [1,947 × 4] (S3: tbl_df/tbl/data.frame)
  ..$ Container: Factor w/ 2 levels "0_program","1_program": 2 1 2 2 2 1 2 1 2 1 ...
  ..$ Type     : Factor w/ 5 levels "data registration",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Start    : num [1:1947] -174 -174 -173 -173 -173 ...
  ..$ Value    : Factor w/ 1850 levels "27e92650","27e9cf40",..: 1 901 2 3 4 902 5 903 6 904 ...
 $ Events      : tibble [52,791 × 4] (S3: tbl_df/tbl/data.frame)
  ..$ Container: Factor w/ 2 levels "0_program","1_program": 1 2 2 2 2 2 1 2 2 1 ...
  ..$ Type     : Factor w/ 5 levels "data registration",..: 3 3 5 4 5 4 5 5 4 4 ...
  ..$ Start    : num [1:52791] -175 -175 -173 -173 -173 ...
  ..$ Value    : Factor w/ 18440 levels "1","10","100",..: 18440 18440 1 1 9525 9525 1 12443 12443 1 ...
 $ Last        : tibble [56,599 × 4] (S3: tbl_df/tbl/data.frame)
  ..$ JobId  : Factor w/ 56599 levels "0_402","0_3102",..: 1 2 3 4 5 6 7 8 9 10 ...
  ..$ End    : num [1:56599] NA NA 470 NA NA ...
  ..$ Last   : Factor w/ 56599 levels "0_402","0_3102",..: NA NA 11622 NA NA 11768 NA NA NA 45256 ...
  ..$ LastEnd: num [1:56599] -1.80e+308 -1.80e+308 2.74e+02 -1.80e+308 -1.80e+308 ...
 $ Link        : tibble [11,780 × 13] (S3: tbl_df/tbl/data.frame)
  ..$ Container: Factor w/ 3 levels "0_program","1_program",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Type     : Factor w/ 2 levels "MPI communication",..: 2 2 2 2 2 2 2 2 2 2 ...
  ..$ Start    : num [1:11780] -169 -169 -168 -168 -168 ...
  ..$ End      : num [1:11780] -169 -169 -168 -168 -168 ...
  ..$ Duration : num [1:11780] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Size     : int [1:11780] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Origin   : Factor w/ 46 levels "0_CPU0","0_CPU1",..: 21 22 6 7 10 11 12 14 15 13 ...
  ..$ Dest     : Factor w/ 46 levels "0_CPU0","0_CPU1",..: 15 12 14 13 22 16 8 21 10 11 ...
  ..$ Key      : Factor w/ 11780 levels "mpicom_0","mpicom_1",..: 821 822 2893 4004 5115 6226 7337 8448 9559 10670 ...
  ..$ Tag      : Factor w/ 79 levels "1601","1602",..: NA NA NA NA NA NA NA NA NA NA ...
  ..$ MPIType  : Factor w/ 1 level "PointToPoint": NA NA NA NA NA NA NA NA NA NA ...
  ..$ Priority : int [1:11780] NA NA NA NA NA NA NA NA NA NA ...
  ..$ Handle   : Factor w/ 79 levels "2905e9b0, x, 1, 1",..: NA NA NA NA NA NA NA NA NA NA ...
 $ Memory_state: tibble [360 × 9] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : Factor w/ 2 levels "0_MEMMANAGER0",..: 2 2 2 2 2 2 2 2 2 2 ...
  ..$ Start       : num [1:360] -0.705 -0.7 11.582 11.585 23.594 ...
  ..$ End         : num [1:360] -0.704 -0.682 11.583 11.594 23.596 ...
  ..$ Duration    : num [1:360] 0.00137 0.01775 0.00143 0.00966 0.00135 ...
  ..$ Depth       : num [1:360] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Value       : Factor w/ 3 levels "Allocating","AllocatingReuse",..: 2 1 2 1 2 1 2 1 2 1 ...
  ..$ Node        : Factor w/ 1 level "0": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Resource    : Factor w/ 2 levels "0_MEMMANAGER0",..: 2 2 2 2 2 2 2 2 2 2 ...
  ..$ ResourceType: Factor w/ 1 level "MEMMANAGER": 1 1 1 1 1 1 1 1 1 1 ...
 $ Other_state : tibble [137,820 × 10] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : Factor w/ 2 levels "0_UserThread103748",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Type        : Factor w/ 1 level "User Thread State": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Start       : num [1:137820] -210 -210 -174 -174 -174 ...
  ..$ End         : num [1:137820] -210 -210 -174 -174 -174 ...
  ..$ Duration    : num [1:137820] 0.02407 0.08964 0.00455 0.02205 0.00496 ...
  ..$ Depth       : num [1:137820] 0 0 0 0 1 0 1 0 0 0 ...
  ..$ Value       : Factor w/ 8 levels "Building task",..: 5 5 2 4 1 6 5 3 2 4 ...
  ..$ Node        : Factor w/ 1 level "0": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Resource    : Factor w/ 2 levels "0_UserThread103748",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ ResourceType: Factor w/ 1 level "UserThread": 1 1 1 1 1 1 1 1 1 1 ...
 $ Starpu      : tibble [333,221 × 13] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : chr [1:333221] "0_CPU0" "0_CPU0" "0_CPU0" "0_CPU0" ...
  ..$ Start       : num [1:333221] -210 -210 -210 -210 -210 ...
  ..$ End         : num [1:333221] -210 -210 -210 -210 -210 ...
  ..$ Duration    : num [1:333221] 0.17591 0 0.00449 0.0057 0.00754 ...
  ..$ Depth       : num [1:333221] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Value       : Factor w/ 19 levels "0.000000","1.000000",..: 13 14 12 15 17 18 14 14 11 14 ...
  ..$ Size        : int [1:333221] NA NA NA NA NA NA NA NA NA NA ...
  ..$ NumaNodes   : chr [1:333221] NA NA NA NA ...
  ..$ Node        : Factor w/ 2 levels "0","1": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Resource    : Factor w/ 23 levels "CPU0","CPU1",..: 1 1 1 1 1 1 1 1 1 1 ...
  ..$ ResourceType: Factor w/ 2 levels "CPU","tate": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Height      : num [1:333221] 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Position    : num [1:333221] 44 44 44 44 44 44 44 44 44 44 ...
 $ Task_handles: tibble [98,624 × 4] (S3: tbl_df/tbl/data.frame)
  ..$ JobId  : chr [1:98624] "0_1" "1_1" "0_2" "1_2" ...
  ..$ Handles: Factor w/ 1720 levels "27e92650","27e9cf40",..: 861 1 862 2 863 3 864 4 865 5 ...
  ..$ Modes  : Factor w/ 4 levels "R","RW","RWC",..: 4 4 4 4 4 4 4 4 4 4 ...
  ..$ Sizes  : int [1:98624] 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 1036800 ...
 $ Tasks       : tibble [54,344 × 21] (S3: tbl_df/tbl/data.frame)
  ..$ Control    : chr [1:54344] NA NA NA NA ...
  ..$ JobId      : chr [1:54344] "0_1" "1_1" "0_2" "1_2" ...
  ..$ SubmitOrder: int [1:54344] 1 1 2 2 3 3 4 4 5 5 ...
  ..$ SubmitTime : num [1:54344] -173 -173 -173 -173 -173 ...
  ..$ MPIRank    : int [1:54344] 0 1 0 1 0 1 0 1 0 1 ...
  ..$ Name       : chr [1:54344] "dplgsy" "dplgsy" "dplgsy" "dplgsy" ...
  ..$ Model      : chr [1:54344] "dplgsy" "dplgsy" "dplgsy" "dplgsy" ...
  ..$ File       : chr [1:54344] "starpu_mpi_task_insert.c" "starpu_mpi_task_insert.c" "starpu_mpi_task_insert.c" "starpu_mpi_task_insert.c" ...
  ..$ Line       : num [1:54344] 773 773 773 773 773 773 773 773 773 773 ...
  ..$ Priority   : int [1:54344] 0 1 2 3 4 5 6 7 8 9 ...
  ..$ Tag        : chr [1:54344] "0" "0" "0" "0" ...
  ..$ WorkerId   : int [1:54344] 1 1 2 2 3 3 4 4 5 5 ...
  ..$ MemoryNode : int [1:54344] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ StartTime  : num [1:54344] -173 -173 -173 -173 -173 ...
  ..$ EndTime    : num [1:54344] -169 -170 -170 -170 -170 ...
  ..$ Footprint  : chr [1:54344] "b82a557" "b82a557" "b82a557" "b82a557" ...
  ..$ Parameters : chr [1:54344] "M360x360x7" "M360x360x7" "M360x360x7" "M360x360x7" ...
  ..$ NumaNodes  : chr [1:54344] "-1" "-1" "-1" "-1" ...
  ..$ DependsOn  : chr [1:54344] NA NA NA NA ...
  ..$ DepLabels  : chr [1:54344] NA NA NA NA ...
  ..$ Iteration  : int [1:54344] NA NA NA NA NA NA NA NA NA NA ...
 $ Variable    : tibble [157,980 × 9] (S3: tbl_df/tbl/data.frame)
  ..$ ResourceId  : Factor w/ 50 levels "0_CPU0","0_CPU1",..: 23 1 1 1 1 1 1 1 1 1 ...
  ..$ Type        : chr [1:157980] "Used (MB)" "GFlop/s" "GFlop/s" "GFlop/s" ...
  ..$ Start       : num [1:157980] -211 -210 -172 -168 -166 ...
  ..$ End         : num [1:157980] -175 -172 -168 -166 -162 ...
  ..$ Duration    : num [1:157980] 36.01 38.44 3.82 1.66 4.48 ...
  ..$ Value       : num [1:157980] 0 0 0 0 0 0 0 0 0 0 ...
  ..$ Node        : Factor w/ 2 levels "0","1": 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Resource    : Factor w/ 25 levels "CPU0","CPU1",..: 23 1 1 1 1 1 1 1 1 1 ...
  ..$ ResourceType: Factor w/ 4 levels "CPU","MEMMANAGER",..: 2 1 1 1 1 1 1 1 1 1 ...
 $ Version     : tibble [1 × 1] (S3: tbl_df/tbl/data.frame)
  ..$ value: chr "0.2.0"
 $ Y           : tibble [46 × 4] (S3: tbl_df/tbl/data.frame)
  ..$ Parent  : chr [1:46] "1_mpict" "1_CPU20" "1_CPU19" "1_CPU18" ...
  ..$ Type    : chr [1:46] "Communication Thread State" "Worker State" "Worker State" "Worker State" ...
  ..$ Height  : num [1:46] 1 1 1 1 1 1 1 1 1 1 ...
  ..$ Position: num [1:46] 0 1 2 3 4 5 6 7 8 9 ...
 $ Zero        : tibble [1 × 1] (S3: tbl_df/tbl/data.frame)
  ..$ value: num 264
 $ config      :List of 33
  ..$ base_size       : num 22
  ..$ expand          : num 0.05
  ..$ idleness_factor : num 5.5
  ..$ log             : logi TRUE
  ..$ title           :List of 1
  .. ..$ active: logi FALSE
  ..$ utiltreenode    :List of 2
  .. ..$ active: logi FALSE
  .. ..$ legend: logi FALSE
  ..$ utiltreedepth   :List of 2
  .. ..$ active: logi FALSE
  .. ..$ legend: logi FALSE
  ..$ computingnodes  :List of 1
  .. ..$ active: logi FALSE
  ..$ atree           :List of 7
  .. ..$ active        : logi FALSE
  .. ..$ zoom          :List of 2
  .. .. ..$ start: num 0
  .. .. ..$ end  : num 100
  .. ..$ legend        : logi FALSE
  .. ..$ computation   :List of 2
  .. .. ..$ active: logi FALSE
  .. .. ..$ pruned:List of 1
  .. .. .. ..$ active: logi FALSE
  .. ..$ initialization:List of 1
  .. .. ..$ active: logi FALSE
  .. ..$ communication :List of 1
  .. .. ..$ active: logi FALSE
  .. ..$ anomalies     :List of 1
  .. .. ..$ active: logi FALSE
  ..$ activenodes     :List of 4
  .. ..$ active     : logi FALSE
  .. ..$ nodememuse :List of 3
  .. .. ..$ active     : logi FALSE
  .. .. ..$ legend     : logi TRUE
  .. .. ..$ aggregation:List of 2
  .. .. .. ..$ active: logi FALSE
  .. .. .. ..$ step  : num 100
  .. ..$ aggregation:List of 2
  .. .. ..$ active: logi FALSE
  .. .. ..$ step  : num 100
  .. ..$ legend     : logi FALSE
  ..$ lackready       :List of 2
  .. ..$ aggregation: num 200
  .. ..$ active     : logi FALSE
  ..$ kiteration      :List of 3
  .. ..$ active : logi FALSE
  .. ..$ pernode: logi FALSE
  .. ..$ subite : logi FALSE
  ..$ st              :List of 16
  .. ..$ active      : logi TRUE
  .. ..$ idleness_all: logi TRUE
  .. ..$ labels      : chr "NODES_only"
  .. ..$ legend      : logi TRUE
  .. ..$ makespan    : logi TRUE
  .. ..$ cpb         : logi FALSE
  .. ..$ cpb_mpi     :List of 2
  .. .. ..$ active     : logi FALSE
  .. .. ..$ theoretical: logi FALSE
  .. ..$ expand      : num 0.05
  .. ..$ idleness    : logi FALSE
  .. ..$ tasks       :List of 2
  .. .. ..$ active: logi FALSE
  .. .. ..$ levels: num 2
  .. ..$ outliers    : logi FALSE
  .. ..$ abe         :List of 5
  .. .. ..$ active   : logi TRUE
  .. .. ..$ size     : num 5
  .. .. ..$ bar_color: chr "grey"
  .. .. ..$ text     : logi TRUE
  .. .. ..$ label    : logi TRUE
  .. ..$ aggregation :List of 4
  .. .. ..$ active: logi FALSE
  .. .. ..$ method: chr "nodes"
  .. .. ..$ states: chr "dgemm"
  .. .. ..$ step  : num 1000
  .. ..$ rect_outline: logi FALSE
  .. ..$ alpha       : num 0.5
  .. ..$ drop_small  : num 0
  ..$ summary_nodes   :List of 2
  .. ..$ active: logi FALSE
  .. ..$ legend: logi FALSE
  ..$ pmtool          :List of 4
  .. ..$ kiteration:List of 1
  .. .. ..$ active: logi FALSE
  .. ..$ state     :List of 1
  .. .. ..$ active: logi FALSE
  .. ..$ bounds    :List of 2
  .. .. ..$ active: logi FALSE
  .. .. ..$ label : logi TRUE
  .. ..$ makespan  : logi TRUE
  ..$ memory          :List of 3
  .. ..$ state    :List of 8
  .. .. ..$ active: logi FALSE
  .. .. ..$ height: num 2
  .. .. ..$ border: logi FALSE
  .. .. ..$ depth :List of 1
  .. .. .. ..$ height: num 0
  .. .. ..$ text  : logi FALSE
  .. .. ..$ total : logi FALSE
  .. .. ..$ select: chr "Allocating"
  .. .. ..$ angle : num 90
  .. ..$ transfers:List of 4
  .. .. ..$ active: logi FALSE
  .. .. ..$ arrow : logi FALSE
  .. .. ..$ border: logi FALSE
  .. .. ..$ total : logi FALSE
  .. ..$ combined : logi FALSE
  ..$ submitted       :List of 1
  .. ..$ active: logi FALSE
  ..$ starpu          :List of 2
  .. ..$ active     : logi FALSE
  .. ..$ aggregation:List of 1
  .. .. ..$ active: logi FALSE
  ..$ node_events     :List of 2
  .. ..$ active: logi FALSE
  .. ..$ legend: logi TRUE
  ..$ ready           :List of 4
  .. ..$ active    : logi FALSE
  .. ..$ limit     : logi NA
  .. ..$ lack_ready:List of 1
  .. .. ..$ active: logi FALSE
  .. ..$ step      : num 100
  ..$ gflops          :List of 3
  .. ..$ active: logi FALSE
  .. ..$ facet : logi TRUE
  .. ..$ limit : logi FALSE
  ..$ usedmemory      :List of 2
  .. ..$ active: logi FALSE
  .. ..$ legend: logi FALSE
  ..$ imbalance       :List of 2
  .. ..$ active: logi FALSE
  .. ..$ limit : num 1
  ..$ power_imbalance :List of 2
  .. ..$ active: logi FALSE
  .. ..$ limit : num 1
  ..$ hete_imbalance  :List of 2
  .. ..$ active: logi FALSE
  .. ..$ limit : num 1
  ..$ utilheatmap     :List of 2
  .. ..$ active: logi FALSE
  .. ..$ labels: chr "1"
  ..$ gpubandwidth    :List of 1
  .. ..$ active: logi FALSE
  ..$ mpibandwidth    :List of 1
  .. ..$ active: logi FALSE
  ..$ mpiconcurrent   :List of 1
  .. ..$ active: logi FALSE
  ..$ mpiconcurrentout:List of 1
  .. ..$ active: logi FALSE
  ..$ mpistate        :List of 2
  .. ..$ active: logi FALSE
  .. ..$ label : chr "ALL"
  ..$ guided          :List of 3
  .. ..$ active         : logi FALSE
  .. ..$ agg_type_height: num 50
  .. ..$ node_height    : num 10
  ..$ vertical_lines  :List of 1
  .. ..$ active: logi FALSE
 - attr(*, "class")= chr "starvz_data"
#+end_example

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
svz$Starpu |>
  distinct(Value)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 15 × 1
   Value          
   <fct>          
 1 Initializing   
 2 Overhead       
 3 Idle           
 4 Progressing    
 5 Scheduling     
 6 Sleeping       
 7 FetchingInput  
 8 PushingOutput  
 9 Callback       
10 Submitting task
11 data_cpy       
12 0.000000       
13 1.000000       
14 2.000000       
15 3.000000
#+end_example

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
svz$Events |>
  count(Type)
#+end_src

#+RESULTS:
: # A tibble: 4 × 2
:   Type                    n
:   <fct>               <int>
: 1 data unregistration  1947
: 2 program event type      4
: 3 Task Pop            25420
: 4 Task Push           25420
